/*
== Задача 3 == 
инициализируй package.json (npm init -y)
установи библиотеку chalk (npm i chalk)
Проверь package-lock.json
После установки chalk открой package-lock.json

Найди:
"name": "chalk"
"version": ...
"dependencies" (вложенные зависимости chalk)

📌 Напиши себе в комментарий — зачем нужен package-lock.json
*/

// package-lock.json — это файл, который фиксирует точные версии установленных зависимостей.
// Он нужен для того, чтобы при установке на других компьютерах все библиотеки были одной и той же версии.
// Это защищает проект от случайных обновлений, которые могут сломать код.